import {Md5} from "md5-typescript";

export const randomId = () => {
    // 随机ID
    // return (Math.random() * 10000000).toString(16).substr(0, 4) + (new Date()).getTime() + Math.random().toString();
    return Md5.init(
        (Math.random() * 10000000).toString(16).substr(0, 4) +
        new Date().getTime() +
        Math.random().toString(),
    );
};

export const radomFloat = (m: number, n: number) => {
    // 生成一定范围内的随机两位小数
    let num = Math.floor(Math.random() * (m - n) + n);
    num = parseInt(num + '') + parseFloat(Math.random() + '');
    num = Math.round(num * 100) / 100;
    return num;
};

export const itemCategory: any = [
    {
        "code": "011102",
        "desc": "采煤机配件"
    },
    {
        "code": "011108",
        "desc": "掘进机配件"
    },
    {
        "code": "011112",
        "desc": "液压支架配件"
    },
    {
        "code": "011114",
        "desc": "电液控制系统配件"
    },
    {
        "code": "011116",
        "desc": "乳化液泵站配件"
    },
    {
        "code": "011118",
        "desc": "喷雾泵站配件"
    },
    {
        "code": "011130",
        "desc": "采掘设备通用配件"
    },
    {
        "code": "011504",
        "desc": "装岩机配件"
    },
    {
        "code": "011702",
        "desc": "井下刮板输送机配件"
    },
    {
        "code": "011704",
        "desc": "井下转载机配件"
    },
    {
        "code": "011716",
        "desc": "矿用机车配件"
    },
    {
        "code": "011720",
        "desc": "井下防爆无轨胶轮车配件"
    },
    {
        "code": "011908",
        "desc": "矿井提升机配件"
    },
    {
        "code": "020704",
        "desc": "汽机辅助设备配件"
    },
    {
        "code": "030504",
        "desc": "轨道联结件"
    },
    {
        "code": "060502",
        "desc": "反应器"
    },
    {
        "code": "060922",
        "desc": "捣固焦炉配件"
    },
    {
        "code": "069904",
        "desc": "煤焦化专用机械设备配件"
    },
    {
        "code": "069999",
        "desc": "煤化工设备配件"
    },
    {
        "code": "080302",
        "desc": "内燃机油"
    },
    {
        "code": "080304",
        "desc": "齿轮油"
    },
    {
        "code": "080306",
        "desc": "液压油"
    },
    {
        "code": "080308",
        "desc": "全损耗系统用油"
    },
    {
        "code": "080312",
        "desc": "压缩机油"
    },
    {
        "code": "080506",
        "desc": "乳化液"
    },
    {
        "code": "080710",
        "desc": "锂基润滑脂"
    },
    {
        "code": "080712",
        "desc": "复合锂基润滑脂"
    },
    {
        "code": "080718",
        "desc": "脲基润滑脂"
    },
    {
        "code": "080724",
        "desc": "高低温润滑脂"
    },
    {
        "code": "080732",
        "desc": "特种润滑脂"
    },
    {
        "code": "090314",
        "desc": "角钢"
    },
    {
        "code": "090324",
        "desc": "圆钢"
    },
    {
        "code": "090326",
        "desc": "方钢"
    },
    {
        "code": "090328",
        "desc": "扁钢"
    },
    {
        "code": "090702",
        "desc": "钢板"
    },
    {
        "code": "090902",
        "desc": "无缝钢管"
    },
    {
        "code": "090904",
        "desc": "焊接钢管"
    },
    {
        "code": "100502",
        "desc": "矿用移动型阻燃橡套电缆"
    },
    {
        "code": "100504",
        "desc": "矿用固定敷设阻燃电缆"
    },
    {
        "code": "100702",
        "desc": "船用电力电缆"
    },
    {
        "code": "100904",
        "desc": "聚氯乙烯绝缘电线电缆"
    },
    {
        "code": "101308",
        "desc": "交联电力电缆"
    },
    {
        "code": "101310",
        "desc": "特殊电力电缆"
    },
    {
        "code": "101504",
        "desc": "塑料绝缘控制电缆"
    },
    {
        "code": "101508",
        "desc": "信号电缆"
    },
    {
        "code": "101906",
        "desc": "电伴热带"
    },
    {
        "code": "102102",
        "desc": "各种光缆"
    },
    {
        "code": "102304",
        "desc": "电缆导体用接线端头或线鼻子"
    },
    {
        "code": "102310",
        "desc": "电缆桥架及附件"
    },
    {
        "code": "102314",
        "desc": "电力线路金具"
    },
    {
        "code": "110106",
        "desc": "气象仪器"
    },
    {
        "code": "111104",
        "desc": "通信、线缆检测分析仪器"
    },
    {
        "code": "111504",
        "desc": "气体减压器"
    },
    {
        "code": "111508",
        "desc": "标准压力表"
    },
    {
        "code": "111510",
        "desc": "压力表"
    },
    {
        "code": "111512",
        "desc": "压力变送器"
    },
    {
        "code": "111514",
        "desc": "差压变送器"
    },
    {
        "code": "111518",
        "desc": "特种压力表"
    },
    {
        "code": "111704",
        "desc": "流量计"
    },
    {
        "code": "111916",
        "desc": "磁翻转液位计"
    },
    {
        "code": "111922",
        "desc": "雷达物位计"
    },
    {
        "code": "111990",
        "desc": "物位仪表配件"
    },
    {
        "code": "112126",
        "desc": "酸度仪"
    },
    {
        "code": "112140",
        "desc": "可燃有毒气体检测器"
    },
    {
        "code": "112190",
        "desc": "分析仪配件"
    },
    {
        "code": "112302",
        "desc": "记录、显示仪"
    },
    {
        "code": "112306",
        "desc": "巡回检测仪"
    },
    {
        "code": "112504",
        "desc": "电动执行机构"
    },
    {
        "code": "112508",
        "desc": "单座调节阀"
    },
    {
        "code": "112514",
        "desc": "控制球阀"
    },
    {
        "code": "112518",
        "desc": "控制蝶阀"
    },
    {
        "code": "112532",
        "desc": "阀门定位器"
    },
    {
        "code": "112538",
        "desc": "电磁阀"
    },
    {
        "code": "112902",
        "desc": "仪表管件接头"
    },
    {
        "code": "112910",
        "desc": "仪表用套管"
    },
    {
        "code": "112999",
        "desc": "其他仪表管件"
    },
    {
        "code": "113302",
        "desc": "电流表"
    },
    {
        "code": "113314",
        "desc": "万用表"
    },
    {
        "code": "113318",
        "desc": "电阻测量仪器"
    },
    {
        "code": "113330",
        "desc": "电工仪器仪表配件及附件"
    },
    {
        "code": "113504",
        "desc": "测厚仪"
    },
    {
        "code": "113514",
        "desc": "传感器及转换器"
    },
    {
        "code": "113722",
        "desc": "计量标准器具附件"
    },
    {
        "code": "113912",
        "desc": "集中取样分析设备"
    },
    {
        "code": "113990",
        "desc": "实验室仪器及装置配件"
    },
    {
        "code": "114114",
        "desc": "光学仪器附件"
    },
    {
        "code": "114306",
        "desc": "流量校验仪器及设备"
    },
    {
        "code": "114502",
        "desc": "气体安全检测仪器"
    },
    {
        "code": "120106",
        "desc": "聚酯输送带"
    },
    {
        "code": "120502",
        "desc": "各种输送带"
    },
    {
        "code": "130108",
        "desc": "高压球阀"
    },
    {
        "code": "130302",
        "desc": "中压闸阀"
    },
    {
        "code": "130304",
        "desc": "中压截止阀"
    },
    {
        "code": "130308",
        "desc": "中压球阀"
    },
    {
        "code": "130502",
        "desc": "低压闸阀"
    },
    {
        "code": "130504",
        "desc": "低压截止阀"
    },
    {
        "code": "130516",
        "desc": "低压止回阀"
    },
    {
        "code": "130520",
        "desc": "低压蝶阀"
    },
    {
        "code": "130524",
        "desc": "低压球阀"
    },
    {
        "code": "130526",
        "desc": "低压疏水阀"
    },
    {
        "code": "130599",
        "desc": "其他低压阀门"
    },
    {
        "code": "130706",
        "desc": "中压安全阀"
    },
    {
        "code": "130710",
        "desc": "低压安全阀"
    },
    {
        "code": "131504",
        "desc": "塑料阀"
    },
    {
        "code": "131999",
        "desc": "其他各种阀门"
    },
    {
        "code": "132104",
        "desc": "对焊法兰"
    },
    {
        "code": "132106",
        "desc": "平焊法兰"
    },
    {
        "code": "132116",
        "desc": "盲法兰"
    },
    {
        "code": "132704",
        "desc": "单头螺纹短节"
    },
    {
        "code": "132706",
        "desc": "双头螺纹短节"
    },
    {
        "code": "132902",
        "desc": "弯头"
    },
    {
        "code": "133302",
        "desc": "三通"
    },
    {
        "code": "133304",
        "desc": "四通"
    },
    {
        "code": "133902",
        "desc": "各种膨胀节(补偿器)"
    },
    {
        "code": "134102",
        "desc": "各种金属软管"
    },
    {
        "code": "134302",
        "desc": "各种阻火器及配件"
    },
    {
        "code": "140102",
        "desc": "单级清水离心泵"
    },
    {
        "code": "140106",
        "desc": "多级清水离心泵"
    },
    {
        "code": "140132",
        "desc": "潜水泵"
    },
    {
        "code": "141108",
        "desc": "齿轮泵"
    },
    {
        "code": "141302",
        "desc": "各种其他泵"
    },
    {
        "code": "141502",
        "desc": "单级清水离心泵配件"
    },
    {
        "code": "141510",
        "desc": "单级耐腐蚀离心泵配件"
    },
    {
        "code": "141520",
        "desc": "污水泵配件"
    },
    {
        "code": "141522",
        "desc": "渣浆泵配件"
    },
    {
        "code": "142308",
        "desc": "隔膜泵配件"
    },
    {
        "code": "142310",
        "desc": "计量泵配件"
    },
    {
        "code": "160112",
        "desc": "铁线"
    },
    {
        "code": "160116",
        "desc": "普通钢丝绳"
    },
    {
        "code": "160118",
        "desc": "重要用途钢丝绳"
    },
    {
        "code": "160144",
        "desc": "脚手架"
    },
    {
        "code": "160146",
        "desc": "金属扣件"
    },
    {
        "code": "160199",
        "desc": "其他黑色金属材料及制品"
    },
    {
        "code": "160302",
        "desc": "焊条"
    },
    {
        "code": "160502",
        "desc": "螺栓"
    },
    {
        "code": "160504",
        "desc": "螺柱"
    },
    {
        "code": "160506",
        "desc": "螺母"
    },
    {
        "code": "160902",
        "desc": "巷道金属支架"
    },
    {
        "code": "160916",
        "desc": "金属防护、支护用品附件及配件"
    },
    {
        "code": "170302",
        "desc": "玻璃"
    },
    {
        "code": "170304",
        "desc": "玻璃纤维及其制品"
    },
    {
        "code": "170510",
        "desc": "实验室常备玻璃仪器"
    },
    {
        "code": "170712",
        "desc": "玻璃钢板"
    },
    {
        "code": "171502",
        "desc": "普通轮胎"
    },
    {
        "code": "171506",
        "desc": "传动带"
    },
    {
        "code": "171508",
        "desc": "橡胶板"
    },
    {
        "code": "171510",
        "desc": "橡胶管"
    },
    {
        "code": "171516",
        "desc": "防护类胶布"
    },
    {
        "code": "171518",
        "desc": "橡胶零件"
    },
    {
        "code": "171520",
        "desc": "胶管总成"
    },
    {
        "code": "171704",
        "desc": "塑料板"
    },
    {
        "code": "171706",
        "desc": "塑料丝、绳及其他编织品"
    },
    {
        "code": "171710",
        "desc": "塑料零件"
    },
    {
        "code": "171714",
        "desc": "塑料管"
    },
    {
        "code": "171716",
        "desc": "塑料型材"
    },
    {
        "code": "171799",
        "desc": "其他塑料制品"
    },
    {
        "code": "171902",
        "desc": "石棉橡胶板"
    },
    {
        "code": "171908",
        "desc": "石棉绳、线"
    },
    {
        "code": "179904",
        "desc": "竹材及其制品"
    },
    {
        "code": "179910",
        "desc": "风筒及附件"
    },
    {
        "code": "179999",
        "desc": "其他制品"
    },
    {
        "code": "180199",
        "desc": "其他有机化学品"
    },
    {
        "code": "180304",
        "desc": "碱类"
    },
    {
        "code": "180708",
        "desc": "除草剂"
    },
    {
        "code": "181702",
        "desc": "各种其他化工产品"
    },
    {
        "code": "181904",
        "desc": "通用有机试剂"
    },
    {
        "code": "181910",
        "desc": "基准及标准试剂"
    },
    {
        "code": "182102",
        "desc": "调和漆"
    },
    {
        "code": "182114",
        "desc": "防锈漆"
    },
    {
        "code": "182120",
        "desc": "墙面涂料"
    },
    {
        "code": "182302",
        "desc": "稀释剂"
    },
    {
        "code": "183114",
        "desc": "水处理剂"
    },
    {
        "code": "183708",
        "desc": "活性炭"
    },
    {
        "code": "183902",
        "desc": "各种凡士林"
    },
    {
        "code": "184302",
        "desc": "皮带胶粘材料"
    },
    {
        "code": "184304",
        "desc": "密封结构胶粘剂"
    },
    {
        "code": "184399",
        "desc": "其他胶粘剂"
    },
    {
        "code": "184502",
        "desc": "工业清洗剂"
    },
    {
        "code": "191504",
        "desc": "石膏制品"
    },
    {
        "code": "191902",
        "desc": "砖"
    },
    {
        "code": "191932",
        "desc": "彩钢瓦/瓦楞板"
    },
    {
        "code": "192104",
        "desc": "耐火泥"
    },
    {
        "code": "192702",
        "desc": "普通门"
    },
    {
        "code": "192704",
        "desc": "工业门"
    },
    {
        "code": "192708",
        "desc": "防护栏栅"
    },
    {
        "code": "192904",
        "desc": "卫生洁具"
    },
    {
        "code": "192910",
        "desc": "建筑用小五金"
    },
    {
        "code": "193302",
        "desc": "磨具"
    },
    {
        "code": "193304",
        "desc": "超硬材料磨具"
    },
    {
        "code": "193502",
        "desc": "水暖管件"
    },
    {
        "code": "193504",
        "desc": "采暖散热器"
    },
    {
        "code": "200102",
        "desc": "普通机械密封"
    },
    {
        "code": "200502",
        "desc": "O型密封圈"
    },
    {
        "code": "200506",
        "desc": "防爆密封圈"
    },
    {
        "code": "200508",
        "desc": "油封件"
    },
    {
        "code": "200702",
        "desc": "基本型缠绕垫"
    },
    {
        "code": "200704",
        "desc": "内外环缠绕垫"
    },
    {
        "code": "200706",
        "desc": "带内环缠绕垫"
    },
    {
        "code": "200914",
        "desc": "聚四氟乙烯垫片"
    },
    {
        "code": "209904",
        "desc": "各种其他密封件"
    },
    {
        "code": "210320",
        "desc": "液力偶合器配件"
    },
    {
        "code": "210326",
        "desc": "液压泵站"
    },
    {
        "code": "210330",
        "desc": "液压元件"
    },
    {
        "code": "210502",
        "desc": "球轴承"
    },
    {
        "code": "210504",
        "desc": "滚子轴承"
    },
    {
        "code": "210902",
        "desc": "减速器"
    },
    {
        "code": "211104",
        "desc": "联轴器"
    },
    {
        "code": "211504",
        "desc": "蒸汽锅炉配件"
    },
    {
        "code": "212114",
        "desc": "空冷器"
    },
    {
        "code": "212702",
        "desc": "空气调节机"
    },
    {
        "code": "212904",
        "desc": "往复式压缩机"
    },
    {
        "code": "212908",
        "desc": "压缩机配件"
    },
    {
        "code": "212916",
        "desc": "一般用途通风机"
    },
    {
        "code": "212920",
        "desc": "通风机配件"
    },
    {
        "code": "212998",
        "desc": "其他风机"
    },
    {
        "code": "213158",
        "desc": "空冷凝汽器控制系统"
    },
    {
        "code": "213302",
        "desc": "分散控制系统(DCS)配件"
    },
    {
        "code": "213304",
        "desc": "可编程控制器PLC系统配件"
    },
    {
        "code": "213388",
        "desc": "机器人配件"
    },
    {
        "code": "213708",
        "desc": "除尘设备配件"
    },
    {
        "code": "213710",
        "desc": "过滤装置"
    },
    {
        "code": "213712",
        "desc": "过滤装置配件"
    },
    {
        "code": "213990",
        "desc": "水处理设备配件"
    },
    {
        "code": "214314",
        "desc": "台、案秤"
    },
    {
        "code": "214990",
        "desc": "切焊设备附件"
    },
    {
        "code": "215102",
        "desc": "张紧放线机械"
    },
    {
        "code": "216104",
        "desc": "离心设备配件"
    },
    {
        "code": "216312",
        "desc": "综合保护及通讯系统配件"
    },
    {
        "code": "216320",
        "desc": "喷雾降尘系统配件"
    },
    {
        "code": "216322",
        "desc": "矿井安全监测系统"
    },
    {
        "code": "216324",
        "desc": "矿井安全监测系统配件"
    },
    {
        "code": "217332",
        "desc": "干燥器、干燥机"
    },
    {
        "code": "217344",
        "desc": "加油机"
    },
    {
        "code": "217354",
        "desc": "采样制样设备"
    },
    {
        "code": "219912",
        "desc": "喷射机械配件"
    },
    {
        "code": "219942",
        "desc": "清洗机配件"
    },
    {
        "code": "219964",
        "desc": "硫化机配件"
    },
    {
        "code": "230102",
        "desc": "起重滑车"
    },
    {
        "code": "230106",
        "desc": "手、气、液动葫芦"
    },
    {
        "code": "230108",
        "desc": "电动葫芦"
    },
    {
        "code": "230118",
        "desc": "起重葫芦配件"
    },
    {
        "code": "230120",
        "desc": "绞车、绞盘"
    },
    {
        "code": "230148",
        "desc": "起重机配件"
    },
    {
        "code": "230166",
        "desc": "悬挂单轨系统"
    },
    {
        "code": "230168",
        "desc": "起重吊索具"
    },
    {
        "code": "230790",
        "desc": "输送机配件"
    },
    {
        "code": "230990",
        "desc": "给料机配件"
    },
    {
        "code": "231104",
        "desc": "堆取机械配件"
    },
    {
        "code": "231126",
        "desc": "液体装卸设备配件"
    },
    {
        "code": "231302",
        "desc": "货架、货柜"
    },
    {
        "code": "231306",
        "desc": "仓储辅助设施"
    },
    {
        "code": "241102",
        "desc": "有线电话设备"
    },
    {
        "code": "241108",
        "desc": "无线对讲设备"
    },
    {
        "code": "241110",
        "desc": "移动通信设备"
    },
    {
        "code": "250102",
        "desc": "自带能源便携式电灯"
    },
    {
        "code": "250104",
        "desc": "室内灯具"
    },
    {
        "code": "250106",
        "desc": "公共照明灯具"
    },
    {
        "code": "250110",
        "desc": "防爆灯具"
    },
    {
        "code": "250116",
        "desc": "灯泡/灯管"
    },
    {
        "code": "250190",
        "desc": "照明装置配件"
    },
    {
        "code": "250302",
        "desc": "原电池(组)"
    },
    {
        "code": "250306",
        "desc": "蓄电池(组)"
    },
    {
        "code": "250506",
        "desc": "报警器及类似装置"
    },
    {
        "code": "250706",
        "desc": "交流电动机"
    },
    {
        "code": "250790",
        "desc": "电动机、防爆电动机配件"
    },
    {
        "code": "251128",
        "desc": "变电站配件"
    },
    {
        "code": "251302",
        "desc": "互感器"
    },
    {
        "code": "251506",
        "desc": "变频设备(器)"
    },
    {
        "code": "251508",
        "desc": "变频设备(器)配件"
    },
    {
        "code": "251522",
        "desc": "稳定电源"
    },
    {
        "code": "251526",
        "desc": "不间断电源(UPS)"
    },
    {
        "code": "251538",
        "desc": "整流组件、整流模块"
    },
    {
        "code": "252350",
        "desc": "高压熔断器"
    },
    {
        "code": "252502",
        "desc": "低压电路开关"
    },
    {
        "code": "252504",
        "desc": "低压电路开关配件"
    },
    {
        "code": "252510",
        "desc": "低压电路断路器"
    },
    {
        "code": "252514",
        "desc": "低压电路熔断器"
    },
    {
        "code": "252518",
        "desc": "低压电路的控制电器"
    },
    {
        "code": "252520",
        "desc": "低压电路的控制电器配件"
    },
    {
        "code": "252534",
        "desc": "漏电保护器"
    },
    {
        "code": "252540",
        "desc": "低压电气柜配件"
    },
    {
        "code": "252542",
        "desc": "低压配电箱"
    },
    {
        "code": "252544",
        "desc": "低压配电箱配件"
    },
    {
        "code": "252550",
        "desc": "低压电路插座(插线板)"
    },
    {
        "code": "252552",
        "desc": "插头"
    },
    {
        "code": "252554",
        "desc": "信号隔离器、安全栅"
    },
    {
        "code": "252702",
        "desc": "隔爆型起动控制装置"
    },
    {
        "code": "252706",
        "desc": "隔爆型电磁起动器"
    },
    {
        "code": "252708",
        "desc": "隔爆型电磁起动器配件"
    },
    {
        "code": "252712",
        "desc": "隔爆型馈电开关配件"
    },
    {
        "code": "252718",
        "desc": "防爆电器装置"
    },
    {
        "code": "252724",
        "desc": "防爆接线箱"
    },
    {
        "code": "252728",
        "desc": "防爆电器安装管件"
    },
    {
        "code": "252799",
        "desc": "其他防爆电器及装置配件"
    },
    {
        "code": "252902",
        "desc": "继电器"
    },
    {
        "code": "252904",
        "desc": "继电器配件"
    },
    {
        "code": "252906",
        "desc": "综合保护装置"
    },
    {
        "code": "252908",
        "desc": "综合保护装置配件"
    },
    {
        "code": "259904",
        "desc": "电磁铁"
    },
    {
        "code": "259908",
        "desc": "永久磁铁"
    },
    {
        "code": "259914",
        "desc": "传感器"
    },
    {
        "code": "260702",
        "desc": "一般特种车辆配件"
    },
    {
        "code": "269902",
        "desc": "电瓶车"
    },
    {
        "code": "269904",
        "desc": "电瓶车配件"
    },
    {
        "code": "269906",
        "desc": "人力车"
    },
    {
        "code": "269908",
        "desc": "人力车配件"
    },
    {
        "code": "270102",
        "desc": "手工刀"
    },
    {
        "code": "270320",
        "desc": "钳子"
    },
    {
        "code": "270330",
        "desc": "扳手"
    },
    {
        "code": "270340",
        "desc": "攻丝工具"
    },
    {
        "code": "270358",
        "desc": "成套手工工具"
    },
    {
        "code": "270360",
        "desc": "千斤顶"
    },
    {
        "code": "270390",
        "desc": "通用手工工具零配件"
    },
    {
        "code": "270399",
        "desc": "其他手工工具"
    },
    {
        "code": "270502",
        "desc": "农林手工工具"
    },
    {
        "code": "270508",
        "desc": "煤矿专用手工工具"
    },
    {
        "code": "270702",
        "desc": "防爆扳手"
    },
    {
        "code": "270908",
        "desc": "量尺"
    },
    {
        "code": "270914",
        "desc": "角度尺"
    },
    {
        "code": "271102",
        "desc": "钻头"
    },
    {
        "code": "271516",
        "desc": "气钻"
    },
    {
        "code": "271518",
        "desc": "气扳机"
    },
    {
        "code": "271702",
        "desc": "电动金属切削工具"
    },
    {
        "code": "271704",
        "desc": "电动砂磨工具"
    },
    {
        "code": "271706",
        "desc": "电动装配工具"
    },
    {
        "code": "271714",
        "desc": "建筑用电动工具"
    },
    {
        "code": "271790",
        "desc": "电动工具配件"
    },
    {
        "code": "271799",
        "desc": "其他电动工具"
    },
    {
        "code": "271906",
        "desc": "停送电工具"
    },
    {
        "code": "271910",
        "desc": "电工钳"
    },
    {
        "code": "271999",
        "desc": "其他电工工具"
    },
    {
        "code": "272126",
        "desc": "弹涂机"
    },
    {
        "code": "272302",
        "desc": "泥瓦工具"
    },
    {
        "code": "272504",
        "desc": "油壶"
    },
    {
        "code": "272590",
        "desc": "其他加油工具"
    },
    {
        "code": "280104",
        "desc": "冷藏冷冻电器"
    },
    {
        "code": "280308",
        "desc": "饮用水加工器具"
    },
    {
        "code": "280316",
        "desc": "洗碗(碟)机等食具清洁器具"
    },
    {
        "code": "289910",
        "desc": "音频输入、输出设备"
    },
    {
        "code": "289912",
        "desc": "音频输入、输出设备配件"
    },
    {
        "code": "289924",
        "desc": "电风扇"
    },
    {
        "code": "290116",
        "desc": "装订设备"
    },
    {
        "code": "290124",
        "desc": "办公机械耗材"
    },
    {
        "code": "290302",
        "desc": "计算机"
    },
    {
        "code": "290306",
        "desc": "输入设备"
    },
    {
        "code": "290308",
        "desc": "输出设备"
    },
    {
        "code": "290506",
        "desc": "应用系统"
    },
    {
        "code": "290704",
        "desc": "网络交换机、集线器"
    },
    {
        "code": "290706",
        "desc": "网络收发设备"
    },
    {
        "code": "290720",
        "desc": "网络线缆"
    },
    {
        "code": "290799",
        "desc": "计算机网络设备配件"
    },
    {
        "code": "290902",
        "desc": "各种摄影摄像器材"
    },
    {
        "code": "300102",
        "desc": "安全防护服"
    },
    {
        "code": "300104",
        "desc": "安全帽"
    },
    {
        "code": "300108",
        "desc": "防护手套"
    },
    {
        "code": "300112",
        "desc": "防护鞋、靴"
    },
    {
        "code": "300116",
        "desc": "呼吸防护用品"
    },
    {
        "code": "300120",
        "desc": "安全防护用具"
    },
    {
        "code": "300199",
        "desc": "其他安全防护用品"
    },
    {
        "code": "300314",
        "desc": "清洁卫生类用品"
    },
    {
        "code": "300502",
        "desc": "灭火器"
    },
    {
        "code": "300510",
        "desc": "消防水带"
    },
    {
        "code": "300512",
        "desc": "消防栓"
    },
    {
        "code": "300518",
        "desc": "消防辅助器材"
    },
    {
        "code": "300522",
        "desc": "消防系统及器材配件"
    },
    {
        "code": "330306",
        "desc": "桌面办公用品"
    },
    {
        "code": "330506",
        "desc": "复印、打印、传真纸"
    },
    {
        "code": "330702",
        "desc": "床"
    },
    {
        "code": "330710",
        "desc": "柜子"
    },
    {
        "code": "330712",
        "desc": "架子"
    },
    {
        "code": "330718",
        "desc": "门窗帘及附件"
    },
    {
        "code": "330904",
        "desc": "炊事用具"
    },
    {
        "code": "331306",
        "desc": "医用电子设备"
    },
    {
        "code": "331504",
        "desc": "篷布"
    },
    {
        "code": "331506",
        "desc": "车座套"
    },
    {
        "code": "331702",
        "desc": "各种实验室辅助器材"
    },
    {
        "code": "331902",
        "desc": "家居办公杂品"
    },
    {
        "code": "331906",
        "desc": "布类杂品"
    },
    {
        "code": "331914",
        "desc": "标志牌"
    },
    {
        "code": "331999",
        "desc": "其他类杂品"
    },
    {
        "code": "333102",
        "desc": "工具箱、包"
    }
]